doc/sprl.org
#+TITLE: Spatial Role Labelling Annotation Scheme
#+AUTHOR: Emmanouil Theofanis Chourdakis
#+EMAIL: e.t.chourdakis@qmul.ac.uk
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \usepackage{fullpage}

* Introduction

This is an effort to port the spatial role labeling annotation scheme found in cite:kordjamshidi2017spatial to prolog. 


*** Definitions

#+CAPTION: Relational representations of the SpRL annotation scheme
#+BEGIN_SRC prolog :exports code

trajector(Id). % Trajector with id Id
landmark(Id).  % Landmark with id Id
spatial_indicator(Id). % Spatial indicator
motion_indicator(Id).  % Motion indicator

extent(Id, Extent-Begin). % Text extent Extent that begins at token Begin is assigned to entity Id
path(Id, Path). % Path Path is assigned to entity with id Id

spatial_relation(SpId). % Spatial relation id 
trajector(SpId, TrId). % Trajector entity TrId is assigned to spatial relation SpId
landmark(SpId, LmId). % Same for landmark
spatial_indicator(SpId, SiId). % Same for spatial indicator
motion_indicator(SpId, MId). % Same for motion indicator

srtype(StId).
srtype(SpId, StId). % Assigns a different group of parameters to spatial relation =SpId=.
gtype(StId, Type). % General type  assigned, can be one of {region, direction, distance}.
stype(StId, Type). % Specific type assigned. 

value(StId, Value),

frame_of_reference(SpId, Type).

#+END_SRC

The mentioned entity predicates are:
 - =trajector(Id)=: Specifies a trajector with id Id.
 - =landmark(Id)=: Specifies a landmark with id Id.
 - =spatial_indicator(Id)=: Specifies a spatial indicator with id Id.
 - =motion_indicator(id)=: Specifies a motion indicator with id Id. 
 - =extent(Id, Extent-Begin)=: Assigns the token sequence Extent that starts at token Begin to the entity with id =id=.
 - =path(Id, Path)=: Assigns a path part to a landmark, assigns the landmark to a park. =Path= can be one of:
  - =begin=: The beginning of the path.
  - =middle=: The middle of the path. 
  - =end=: The endpoint of the path.
 - =spatial_relation(Id)=: Specifies a spatial relation with id =Id=.
 
The spatial relation definitions and attributes are:
 - =spatial_relation(SpId)=: Specifies a spatial relation with id =SpId=.
 - =trajector(SpId, TrId)=: Assigns trajector with id =TrId= to spatial relation with id =SpId=.
 - =landmark(SpId, LmId)=: Assigns trajector with id =LmId= to spatial relation with id =SpId=.
 - =spatial_indicator(SpId, SiId)=: Assigns spatial indicator with id =SiId= to spatial relation with id =SpId=.
 - =motion_indicator(SpId, MId)=: Assigns a motion indicator with id =MId= to spatial relation with id =SpId=.
 - =srtype(SpId, StId)=: Assign a group of types (like =gtype=, =stype= and =value= to spatial relation id =SpId=.
 - =gtype(SpId, Type)=: Assigns a general type =Type= to spatial relation type group with id =SpId=. =Type= can be one of:
   - =region=
   - =direction=
   - =distance=
 - =stype(SpId, Type)=: Assigns a specific type =Type= to spatial relation (or type group) with id =SpId=. If =gtype(SpId, region)= is true then =Type= 
 must be =rcc8= and =value= one of spatial formalisms like RCC8+ (Table [[tab:rcc8]]). If =gtype(SpId, direction)= then =Type= is one of:
   =absolute=
   =relative=
 otherwise if =gtype(SpId, distance)=, =Type= must be one of:
   =quantitative=
   =qualitative=
 - =frame_of_reference(SpId, Type)=: Spatial relation with id =SpId= is assigned a frame of reference type =Type= with =Type= being one of:
  -=intrinsic=
  -=relative=
  -=absolute=


