doc/sprl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-22 Κυρ 16:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spatial Role Labelling Annotation Scheme</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Emmanouil Theofanis Chourdakis" />
</head>
<body>
<div id="content">
<h1 class="title">Spatial Role Labelling Annotation Scheme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org153fc58">1. Introduction</a>
<ul>
<li>
<ul>
<li><a href="#org3ffa814">1.0.1. Definitions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf14e8e0">2. Annotation approach</a>
<ul>
<li><a href="#org9c3aa4d">2.1. Reference Resolution</a></li>
<li><a href="#org4e203d4">2.2. Landmarks and Paths</a></li>
<li><a href="#org1ce1bd4">2.3. Spatial Indicators</a></li>
<li><a href="#org0092f76">2.4. Motion indicators</a></li>
</ul>
</li>
<li><a href="#org7cbc506">3. Examples</a>
<ul>
<li><a href="#orgac54522">3.1. Simple Descriptions</a></li>
<li><a href="#orgcf87128">3.2. Complex Descriptions</a>
<ul>
<li><a href="#org03578c1">3.2.1. Complex locative statements</a></li>
<li><a href="#org01ed080">3.2.2. Path and route descriptions</a></li>
<li><a href="#org0d1a39b">3.2.3. Sequential scene descriptions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0c8be3c">4. RCC8^+ Relations</a></li>
<li><a href="#org920bb92">5. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org153fc58" class="outline-2">
<h2 id="org153fc58"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is an effort to port the spatial role labeling annotation scheme found in <a class='org-ref-reference' href="#kordjamshidi2017spatial">kordjamshidi2017spatial</a> to prolog. 
</p>
</div>


<div id="outline-container-org3ffa814" class="outline-4">
<h4 id="org3ffa814"><span class="section-number-4">1.0.1</span> Definitions</h4>
<div class="outline-text-4" id="text-1-0-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Relational representations of the SpRL annotation scheme</label><pre class="src src-prolog">
<span style="color: #84ffff;">trajector</span>(<span style="color: #ffcc80;">Id</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Trajector with id Id</span>
<span style="color: #84ffff;">landmark</span>(<span style="color: #ffcc80;">Id</span>).  <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Landmark with id Id</span>
<span style="color: #84ffff;">spatial_indicator</span>(<span style="color: #ffcc80;">Id</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Spatial indicator</span>
<span style="color: #84ffff;">motion_indicator</span>(<span style="color: #ffcc80;">Id</span>).  <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Motion indicator</span>

<span style="color: #84ffff;">extent</span>(<span style="color: #ffcc80;">Id</span>, <span style="color: #ffcc80;">Extent</span>-<span style="color: #ffcc80;">Begin</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Text extent Extent that begins at token Begin is assigned to entity Id</span>
<span style="color: #84ffff;">path</span>(<span style="color: #ffcc80;">Id</span>, <span style="color: #ffcc80;">Path</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Path Path is assigned to entity with id Id</span>

<span style="color: #84ffff;">spatial_relation</span>(<span style="color: #ffcc80;">SpId</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Spatial relation id </span>
<span style="color: #84ffff;">trajector</span>(<span style="color: #ffcc80;">SpId</span>, <span style="color: #ffcc80;">TrId</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Trajector entity TrId is assigned to spatial relation SpId</span>
<span style="color: #84ffff;">landmark</span>(<span style="color: #ffcc80;">SpId</span>, <span style="color: #ffcc80;">LmId</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Same for landmark</span>
<span style="color: #84ffff;">spatial_indicator</span>(<span style="color: #ffcc80;">SpId</span>, <span style="color: #ffcc80;">SiId</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Same for spatial indicator</span>
<span style="color: #84ffff;">motion_indicator</span>(<span style="color: #ffcc80;">SpId</span>, <span style="color: #ffcc80;">MId</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Same for motion indicator</span>

<span style="color: #84ffff;">srtype</span>(<span style="color: #ffcc80;">StId</span>).
<span style="color: #84ffff;">srtype</span>(<span style="color: #ffcc80;">SpId</span>, <span style="color: #ffcc80;">StId</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Assigns a different group of parameters to spatial relation =SpId=.</span>
<span style="color: #84ffff;">gtype</span>(<span style="color: #ffcc80;">StId</span>, <span style="color: #ffcc80;">Type</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">General type  assigned, can be one of {region, direction, distance}.</span>
<span style="color: #84ffff;">stype</span>(<span style="color: #ffcc80;">StId</span>, <span style="color: #ffcc80;">Type</span>). <span style="color: #b0bec5;">% </span><span style="color: #b0bec5;">Specific type assigned. </span>

<span style="color: #84ffff;">value</span>(<span style="color: #ffcc80;">StId</span>, <span style="color: #ffcc80;">Value</span>),

<span style="color: #84ffff;">frame_of_reference</span>(<span style="color: #ffcc80;">SpId</span>, <span style="color: #ffcc80;">Type</span>).

</pre>
</div>

<p>
The mentioned entity predicates are:
</p>
<ul class="org-ul">
<li><code>trajector(Id)</code>: Specifies a trajector with id Id.</li>
<li><code>landmark(Id)</code>: Specifies a landmark with id Id.</li>
<li><code>spatial_indicator(Id)</code>: Specifies a spatial indicator with id Id.</li>
<li><code>motion_indicator(id)</code>: Specifies a motion indicator with id Id.</li>
<li><code>extent(Id, Extent-Begin)</code>: Assigns the token sequence Extent that starts at token Begin to the entity with id <code>id</code>.</li>
<li><code>path(Id, Path)</code>: Assigns a path part to a landmark, assigns the landmark to a park. <code>Path</code> can be one of:
<ul class="org-ul">
<li><code>begin</code>: The beginning of the path.</li>
<li><code>middle</code>: The middle of the path.</li>
<li><code>end</code>: The endpoint of the path.</li>
</ul></li>
<li><code>spatial_relation(Id)</code>: Specifies a spatial relation with id <code>Id</code>.</li>
</ul>

<p>
The spatial relation definitions and attributes are:
</p>
<ul class="org-ul">
<li><code>spatial_relation(SpId)</code>: Specifies a spatial relation with id <code>SpId</code>.</li>
<li><code>trajector(SpId, TrId)</code>: Assigns trajector with id <code>TrId</code> to spatial relation with id <code>SpId</code>.</li>
<li><code>landmark(SpId, LmId)</code>: Assigns trajector with id <code>LmId</code> to spatial relation with id <code>SpId</code>.</li>
<li><code>spatial_indicator(SpId, SiId)</code>: Assigns spatial indicator with id <code>SiId</code> to spatial relation with id <code>SpId</code>.</li>
<li><code>motion_indicator(SpId, MId)</code>: Assigns a motion indicator with id <code>MId</code> to spatial relation with id <code>SpId</code>.</li>
<li><code>srtype(SpId, StId)</code>: Assign a group of types (like <code>gtype</code>, <code>stype</code> and <code>value</code> to spatial relation id <code>SpId</code>.</li>
<li><code>gtype(SpId, Type)</code>: Assigns a general type <code>Type</code> to spatial relation type group with id <code>SpId</code>. <code>Type</code> can be one of:
<ul class="org-ul">
<li><code>region</code></li>
<li><code>direction</code></li>
<li><code>distance</code></li>
</ul></li>
<li><code>stype(SpId, Type)</code>: Assigns a specific type <code>Type</code> to spatial relation (or type group) with id <code>SpId</code>. If <code>gtype(SpId, region)</code> is true then <code>Type</code></li>
</ul>
<p>
must be <code>rcc8</code> and <code>value</code> one of spatial formalisms like RCC8+ (Table <a href="#orgfb94dcf">1</a>). If <code>gtype(SpId, direction)</code> then <code>Type</code> is one of:
  <code>absolute</code>
  <code>relative</code>
otherwise if <code>gtype(SpId, distance)</code>, <code>Type</code> must be one of:
  <code>quantitative</code>
  <code>qualitative</code>
</p>
<ul class="org-ul">
<li><code>frame_of_reference(SpId, Type)</code>: Spatial relation with id <code>SpId</code> is assigned a frame of reference type <code>Type</code> with <code>Type</code> being one of:
-<code>intrinsic</code>
-<code>relative</code>
-<code>absolute</code></li>
</ul>
</div>
</div>
</div>
