doc/sprl.org
* Annotation approach
  
A number of questions to ask for annotating in order to reduce ambiguity is seen below:

1. Is there any direct (without commonsense implications) spatial description in the sentence?
2. Which words are the indicators (trigger or signal) of the spatial information?
3. Which words are the arguments of those spatial indicators?
 - See the following detailed questions
4. Which tokens have the role of trajector for the spatial indicator and /what/ is the spatial entity described (e.g. object, person)?
5. Which tokens have the role of landmark for the spatial indicator?
 - How is the trajector location described and is there any landmark?
6. Link the above three spatial concepts 
7. If the trajector/landmark are conjuctive phrases:
  1. Annotate all the components separately
  2. Generate all possible spatial relations
8. If you cannot complete the spatial relation (implicit roles exist in the sentence), annotate the missing roles as null/undefined role.
 - Finding the spatial indicator is *always* required. 
9. Is there a complex landmark?
 - If so, describe it in terms of a point in a path.
 - =beginning=, =middle=, =end=.
10. Is there any motion with spatial effects?
 - If so, figure out the /tokens that trigger it/ and the /motion indicator/
11. What is the frame of reference?
 - Maximum one frame for each location
12. Given a predefined set of formal spatial relations, imagine the trajector and landmark as two regions:
 - Which formal relation describes the spatial semantics the best?
13. Does the  spatial relation imply directional semantics?
14. Does the spatial relation imply regional semantics?
15. Does the spatial relation provide any information about the distance?
16. Is one formal semantic type enough for a rough visualization/schematization of the meaning of the spatial relation and locating the objects in the space?
17. Do we need multiple annotations to capture the semantics of the relation and to be able to draw a rough sketch? Annotate with as many as possible semantics that are covered by the relation. 
18. When annotating multiple semantics, choose *only one* fine-grained type for each general category of {=direction=, =region=, =distance=}.

Answers to questions 12-18 require the selection of a formal spatial representation which can involve multiple
choices. 


To aid dealing with ambiguities, the spatial descriptions are categorized into /simple/ and /complex/ descriptions:
 - /simple descriptions/ are spatial descriptions which include one target, at most one landmark and at most one spatial indicator.
 - /complex locative statements/ are locative phrases with more than one landmark.
 - /path and route descriptions/ There is focus shift, for example the speaker explains some target referring to some landmarks but at another point explains another object or landmark e.g. when the focus shifts to another entity as trajector.
 - /sequential scene descriptions/ Those are linked descriptive phrases. After each description usually an object focus shift happens.


** Reference Resolution

In the case there are references instead of real trajectors or landmarks the resolution of references should be done as a post- or pre- processings step. For example, /there/ in the following
example is still a valid landmark. 

#+BEGIN_VERSE
The baloon went over [there]_{lm}
#+END_VERSE

** Landmarks and Paths
In the case we need to annotate landmarks, there are cases where we are describing a motion. In that case the landmark must indicate which part of the path it refers to.
For example:

#+BEGIN_VERSE
John went out of [the room]_{lm}
#+END_VERSE

In this case, we should annotate [the room]_{lm} as:

#+BEGIN_SRC prolog :exports code
landmark(lm1).
extent(lm1, "the room"-8).
path(lm1, beginning).
#+END_SRC

Notice the =beginning= path. This indicates that John was initially in the room.

** Spatial Indicators

Spatial indicators are mostly /prepositions/ but can also be /verbs/, /nouns/ and /adverbs/ as well as /a combination of them/. For example the spatial indicator in:


#+BEGIN_VERSE
He is [in front of]_{s1} the bush
#+END_VERSE

will be annotated as:

#+BEGIN_SRC prolog :exports code
spatial_indicator(s1).
extent(s1, "in front of"-3).
#+END_SRC


** Motion indicators

Motion indicators are mostly /propositional verbs/ but can also be /adverbs/, etc. An example tagging would be:

#+BEGIN_VERSE
The bird [flew to]_{m1} its nest.
#+END_VERSE


#+BEGIN_SRC prolog :exports code
motion_indicator(m1).
extent(m1, "flew to"-3).
#+END_SRC




* Examples

