doc/sprl.html


<div id="outline-container-orgf14e8e0" class="outline-2">
<h2 id="orgf14e8e0"><span class="section-number-2">2</span> Annotation approach</h2>
<div class="outline-text-2" id="text-2">
<p>
A number of questions to ask for annotating in order to reduce ambiguity is seen below:
</p>

<ol class="org-ol">
<li>Is there any direct (without commonsense implications) spatial description in the sentence?</li>
<li>Which words are the indicators (trigger or signal) of the spatial information?</li>
<li>Which words are the arguments of those spatial indicators?
<ul class="org-ul">
<li>See the following detailed questions</li>
</ul></li>
<li>Which tokens have the role of trajector for the spatial indicator and <i>what</i> is the spatial entity described (e.g. object, person)?</li>
<li>Which tokens have the role of landmark for the spatial indicator?
<ul class="org-ul">
<li>How is the trajector location described and is there any landmark?</li>
</ul></li>
<li>Link the above three spatial concepts</li>
<li>If the trajector/landmark are conjuctive phrases:
<ol class="org-ol">
<li>Annotate all the components separately</li>
<li>Generate all possible spatial relations</li>
</ol></li>
<li>If you cannot complete the spatial relation (implicit roles exist in the sentence), annotate the missing roles as null/undefined role.
<ul class="org-ul">
<li>Finding the spatial indicator is <b>always</b> required.</li>
</ul></li>
<li>Is there a complex landmark?
<ul class="org-ul">
<li>If so, describe it in terms of a point in a path.</li>
<li><code>beginning</code>, <code>middle</code>, <code>end</code>.</li>
</ul></li>
<li>Is there any motion with spatial effects?
<ul class="org-ul">
<li>If so, figure out the <i>tokens that trigger it</i> and the <i>motion indicator</i></li>
</ul></li>
<li>What is the frame of reference?
<ul class="org-ul">
<li>Maximum one frame for each location</li>
</ul></li>
<li>Given a predefined set of formal spatial relations, imagine the trajector and landmark as two regions:
<ul class="org-ul">
<li>Which formal relation describes the spatial semantics the best?</li>
</ul></li>
<li>Does the  spatial relation imply directional semantics?</li>
<li>Does the spatial relation imply regional semantics?</li>
<li>Does the spatial relation provide any information about the distance?</li>
<li>Is one formal semantic type enough for a rough visualization/schematization of the meaning of the spatial relation and locating the objects in the space?</li>
<li>Do we need multiple annotations to capture the semantics of the relation and to be able to draw a rough sketch? Annotate with as many as possible semantics that are covered by the relation.</li>
<li>When annotating multiple semantics, choose <b>only one</b> fine-grained type for each general category of {<code>direction</code>, <code>region</code>, <code>distance</code>}.</li>
</ol>

<p>
Answers to questions 12-18 require the selection of a formal spatial representation which can involve multiple
choices. 
</p>


<p>
To aid dealing with ambiguities, the spatial descriptions are categorized into <i>simple</i> and <i>complex</i> descriptions:
</p>
<ul class="org-ul">
<li><i>simple descriptions</i> are spatial descriptions which include one target, at most one landmark and at most one spatial indicator.</li>
<li><i>complex locative statements</i> are locative phrases with more than one landmark.</li>
<li><i>path and route descriptions</i> There is focus shift, for example the speaker explains some target referring to some landmarks but at another point explains another object or landmark e.g. when the focus shifts to another entity as trajector.</li>
<li><i>sequential scene descriptions</i> Those are linked descriptive phrases. After each description usually an object focus shift happens.</li>
</ul>
</div>


<div id="outline-container-org9c3aa4d" class="outline-3">
<h3 id="org9c3aa4d"><span class="section-number-3">2.1</span> Reference Resolution</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In the case there are references instead of real trajectors or landmarks the resolution of references should be done as a post- or pre- processings step. For example, <i>there</i> in the following
example is still a valid landmark. 
</p>

<p class="verse">
The baloon went over [there]<sub>lm</sub><br />
</p>
</div>
</div>

<div id="outline-container-org4e203d4" class="outline-3">
<h3 id="org4e203d4"><span class="section-number-3">2.2</span> Landmarks and Paths</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In the case we need to annotate landmarks, there are cases where we are describing a motion. In that case the landmark must indicate which part of the path it refers to.
For example:
</p>

<p class="verse">
John went out of [the room]<sub>lm</sub><br />
</p>

<p>
In this case, we should annotate [the room]<sub>lm</sub> as:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">landmark</span>(lm1).
<span style="color: #84ffff;">extent</span>(lm1, <span style="color: #9ccc65;">"the room"</span>-8).
<span style="color: #84ffff;">path</span>(lm1, beginning).
</pre>
</div>

<p>
Notice the <code>beginning</code> path. This indicates that John was initially in the room.
</p>
</div>
</div>

<div id="outline-container-org1ce1bd4" class="outline-3">
<h3 id="org1ce1bd4"><span class="section-number-3">2.3</span> Spatial Indicators</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Spatial indicators are mostly <i>prepositions</i> but can also be <i>verbs</i>, <i>nouns</i> and <i>adverbs</i> as well as <i>a combination of them</i>. For example the spatial indicator in:
</p>


<p class="verse">
He is [in front of]<sub>s1</sub> the bush<br />
</p>

<p>
will be annotated as:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">spatial_indicator</span>(s1).
<span style="color: #84ffff;">extent</span>(s1, <span style="color: #9ccc65;">"in front of"</span>-3).
</pre>
</div>
</div>
</div>


<div id="outline-container-org0092f76" class="outline-3">
<h3 id="org0092f76"><span class="section-number-3">2.4</span> Motion indicators</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Motion indicators are mostly <i>propositional verbs</i> but can also be <i>adverbs</i>, etc. An example tagging would be:
</p>

<p class="verse">
The bird [flew to]<sub>m1</sub> its nest.<br />
</p>


<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">motion_indicator</span>(m1).
<span style="color: #84ffff;">extent</span>(m1, <span style="color: #9ccc65;">"flew to"</span>-3).
</pre>
</div>
</div>
</div>
</div>
