doc/sprl.org
** Simple Descriptions

#+BEGIN_VERSE
She is at school.
#+END_VERSE


#+BEGIN_SRC prolog :exports code
trajector(tr1).
extent(tr1, "She"-1).
landmark(lm1).
extent(lm1, school-4).
spatial_indicator(s1).
extent(s1, at-3).
spatial_relation(sr1).
trajector(sr1, tr1).
landmark(sr1, lm1).
spatial_indicator(sr1, s1).
gtype(sr1, region).
stype(sr1, rcc8).
value(sr1, tpp).
frame_of_reference(sr1, intrinsic).
#+END_SRC


#+BEGIN_VERSE
She went to school.
#+END_VERSE


#+BEGIN_SRC prolog :exports code
trajector(tr1).
extent(tr1, "She"-1).
landmark(lm1).
path(lm1, end).
extent(lm1, school-4).
spatial_indicator(s1).
extent(s1, to-3).
motion_indicator(m1).
extent(m1, "went to"-2).

spatial_relation(sr1).
trajector(sr1, tr1).
landmark(sr1, lm1).
spatial_indicator(sr1, s1).
motion_indicator(sr1, m1).
gtype(sr1, region).
stype(sr1, rcc8).
value(sr1, tpp).
frame_of_reference(sr1, intrinsic).
#+END_SRC



#+BEGIN_VERSE
The book is on the table.
#+END_VERSE


#+BEGIN_SRC prolog :exports code
trajector(tr1).
extent(tr1, "The book"-1).

landmark(lm1).
extent(lm1, "the table"-5).

spatial_indicator(s1).
extent(s1, on-4).

spatial_relation(sr1).
trajector(sr1, tr1).
landmark(sr1, lm1).
spatial_indicator(sr1, s1).

gtype(sr1, region).
stype(sr1, rcc8).
value(sr1, on).
frame_of_reference(sr1, intrinsic).
#+END_SRC


#+BEGIN_VERSE
She is playing in the room.
#+END_VERSE


#+BEGIN_SRC prolog :exports code
trajector(tr1).
extent(tr1, "She"-1).

landmark(lm1).
extent(lm1, "the room"-5).

spatial_indicator(s1).
extent(s1, on-4).

spatial_relation(sr1).
trajector(sr1, tr1).
landmark(sr1, lm1).
spatial_indicator(sr1, s1).

gtype(sr1, region).
stype(sr1, rcc8).
value(sr1, on).
frame_of_reference(sr1, intrinsic).
#+END_SRC





** Complex Descriptions

*** Complex locative statements

#+BEGIN_VERSE
The vase is in the living room, on the table under the window.
#+END_VERSE


#+BEGIN_SRC prolog :exports code
trajector(tr1).
extent(tr1, "The vase"-1).
landmark(lm1).
extent(lm1, "the living room").
landmark(lm2).
extent(lm2, "the table").
landmark(lm3).
extent(lm3, "the window").
spatial_indicator(s1).
extent(s1, in-4).
spatial_indicator(s2).
extent(s2, on).
spatial_indicator(s3).
extent(s3, under).

spatial_relation(sr1).
trajector(sr1, tr1).
landmark(sr1, lm1).
spatial_indicator(sr1, s1).
gtype(sr1, region).
stype(sr1, rcc8).
value(sr1, ntpp).
frame_of_reference(sr1, intrinsic).

spatial_relation(sr2).
trajector(sr1, tr1).
landmark(sr1, lm2).
spatial_indicator(sr1, s2).
gtype(sr1, region).
stype(sr1, rcc8).
value(sr1, ec).
frame_of_reference(sr1, intrinsic).

spatial_relation(sr3).
trajector(sr3, tr1).
landmark(sr3, lm3).
spatial_indicator(sr3, s3).
gtype(sr1, direction).
stype(sr1, relative).
value(sr1, below).
frame_of_reference(intrinsic).

#+END_SRC


*** Path and route descriptions
#+BEGIN_VERSE
The man came from between the shops, ran along the road and disappeared down the alley by the church.
#+END_VERSE

Here the motion indicators are omitted. 

#+BEGIN_SRC prolog :exports code

trajector(tr1).
extent(tr1, "the man").

landmark(lm1).
extent(lm1, "the shops").
path(lm1, beginning).

landmark(lm2).
extent(lm2, "the alley").
path(lm2, end).

trajector(tr2).
extent(tr2, "the alley").

landmark(lm3).
extent(lm3, "the church").

spatial_indicator(s1).
extent(s1, "between").

spatial_indicator(s2).
extent(s2, "along").

spatial_indicator(s3).
extent(s3, "down").

spatial_indicator(s4).
extent(s4, "by").

spatial_relation(sr1).
trajector(sr1, tr1).
landmark(sr1, lm1).



#+END_SRC

