doc/sprl.html




<div id="outline-container-org7cbc506" class="outline-2">
<h2 id="org7cbc506"><span class="section-number-2">3</span> Examples</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgac54522" class="outline-3">
<h3 id="orgac54522"><span class="section-number-3">3.1</span> Simple Descriptions</h3>
<div class="outline-text-3" id="text-3-1">
<p class="verse">
She is at school.<br />
</p>


<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">trajector</span>(tr1).
<span style="color: #84ffff;">extent</span>(tr1, <span style="color: #9ccc65;">"She"</span>-1).
<span style="color: #84ffff;">landmark</span>(lm1).
<span style="color: #84ffff;">extent</span>(lm1, school-4).
<span style="color: #84ffff;">spatial_indicator</span>(s1).
<span style="color: #84ffff;">extent</span>(s1, at-3).
<span style="color: #84ffff;">spatial_relation</span>(sr1).
<span style="color: #84ffff;">trajector</span>(sr1, tr1).
<span style="color: #84ffff;">landmark</span>(sr1, lm1).
<span style="color: #84ffff;">spatial_indicator</span>(sr1, s1).
<span style="color: #84ffff;">gtype</span>(sr1, region).
<span style="color: #84ffff;">stype</span>(sr1, rcc8).
<span style="color: #84ffff;">value</span>(sr1, tpp).
<span style="color: #84ffff;">frame_of_reference</span>(sr1, intrinsic).
</pre>
</div>


<p class="verse">
She went to school.<br />
</p>


<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">trajector</span>(tr1).
<span style="color: #84ffff;">extent</span>(tr1, <span style="color: #9ccc65;">"She"</span>-1).
<span style="color: #84ffff;">landmark</span>(lm1).
<span style="color: #84ffff;">path</span>(lm1, end).
<span style="color: #84ffff;">extent</span>(lm1, school-4).
<span style="color: #84ffff;">spatial_indicator</span>(s1).
<span style="color: #84ffff;">extent</span>(s1, to-3).
<span style="color: #84ffff;">motion_indicator</span>(m1).
<span style="color: #84ffff;">extent</span>(m1, <span style="color: #9ccc65;">"went to"</span>-2).

<span style="color: #84ffff;">spatial_relation</span>(sr1).
<span style="color: #84ffff;">trajector</span>(sr1, tr1).
<span style="color: #84ffff;">landmark</span>(sr1, lm1).
<span style="color: #84ffff;">spatial_indicator</span>(sr1, s1).
<span style="color: #84ffff;">motion_indicator</span>(sr1, m1).
<span style="color: #84ffff;">gtype</span>(sr1, region).
<span style="color: #84ffff;">stype</span>(sr1, rcc8).
<span style="color: #84ffff;">value</span>(sr1, tpp).
<span style="color: #84ffff;">frame_of_reference</span>(sr1, intrinsic).
</pre>
</div>



<p class="verse">
The book is on the table.<br />
</p>


<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">trajector</span>(tr1).
<span style="color: #84ffff;">extent</span>(tr1, <span style="color: #9ccc65;">"The book"</span>-1).

<span style="color: #84ffff;">landmark</span>(lm1).
<span style="color: #84ffff;">extent</span>(lm1, <span style="color: #9ccc65;">"the table"</span>-5).

<span style="color: #84ffff;">spatial_indicator</span>(s1).
<span style="color: #84ffff;">extent</span>(s1, on-4).

<span style="color: #84ffff;">spatial_relation</span>(sr1).
<span style="color: #84ffff;">trajector</span>(sr1, tr1).
<span style="color: #84ffff;">landmark</span>(sr1, lm1).
<span style="color: #84ffff;">spatial_indicator</span>(sr1, s1).

<span style="color: #84ffff;">gtype</span>(sr1, region).
<span style="color: #84ffff;">stype</span>(sr1, rcc8).
<span style="color: #84ffff;">value</span>(sr1, on).
<span style="color: #84ffff;">frame_of_reference</span>(sr1, intrinsic).
</pre>
</div>


<p class="verse">
She is playing in the room.<br />
</p>


<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">trajector</span>(tr1).
<span style="color: #84ffff;">extent</span>(tr1, <span style="color: #9ccc65;">"She"</span>-1).

<span style="color: #84ffff;">landmark</span>(lm1).
<span style="color: #84ffff;">extent</span>(lm1, <span style="color: #9ccc65;">"the room"</span>-5).

<span style="color: #84ffff;">spatial_indicator</span>(s1).
<span style="color: #84ffff;">extent</span>(s1, on-4).

<span style="color: #84ffff;">spatial_relation</span>(sr1).
<span style="color: #84ffff;">trajector</span>(sr1, tr1).
<span style="color: #84ffff;">landmark</span>(sr1, lm1).
<span style="color: #84ffff;">spatial_indicator</span>(sr1, s1).

<span style="color: #84ffff;">gtype</span>(sr1, region).
<span style="color: #84ffff;">stype</span>(sr1, rcc8).
<span style="color: #84ffff;">value</span>(sr1, on).
<span style="color: #84ffff;">frame_of_reference</span>(sr1, intrinsic).
</pre>
</div>
</div>
</div>





<div id="outline-container-orgcf87128" class="outline-3">
<h3 id="orgcf87128"><span class="section-number-3">3.2</span> Complex Descriptions</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org03578c1" class="outline-4">
<h4 id="org03578c1"><span class="section-number-4">3.2.1</span> Complex locative statements</h4>
<div class="outline-text-4" id="text-3-2-1">
<p class="verse">
The vase is in the living room, on the table under the window.<br />
</p>


<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #84ffff;">trajector</span>(tr1).
<span style="color: #84ffff;">extent</span>(tr1, <span style="color: #9ccc65;">"The vase"</span>-1).
<span style="color: #84ffff;">landmark</span>(lm1).
<span style="color: #84ffff;">extent</span>(lm1, <span style="color: #9ccc65;">"the living room"</span>).
<span style="color: #84ffff;">landmark</span>(lm2).
<span style="color: #84ffff;">extent</span>(lm2, <span style="color: #9ccc65;">"the table"</span>).
<span style="color: #84ffff;">landmark</span>(lm3).
<span style="color: #84ffff;">extent</span>(lm3, <span style="color: #9ccc65;">"the window"</span>).
<span style="color: #84ffff;">spatial_indicator</span>(s1).
<span style="color: #84ffff;">extent</span>(s1, in-4).
<span style="color: #84ffff;">spatial_indicator</span>(s2).
<span style="color: #84ffff;">extent</span>(s2, on).
<span style="color: #84ffff;">spatial_indicator</span>(s3).
<span style="color: #84ffff;">extent</span>(s3, under).

<span style="color: #84ffff;">spatial_relation</span>(sr1).
<span style="color: #84ffff;">trajector</span>(sr1, tr1).
<span style="color: #84ffff;">landmark</span>(sr1, lm1).
<span style="color: #84ffff;">spatial_indicator</span>(sr1, s1).
<span style="color: #84ffff;">gtype</span>(sr1, region).
<span style="color: #84ffff;">stype</span>(sr1, rcc8).
<span style="color: #84ffff;">value</span>(sr1, ntpp).
<span style="color: #84ffff;">frame_of_reference</span>(sr1, intrinsic).

<span style="color: #84ffff;">spatial_relation</span>(sr2).
<span style="color: #84ffff;">trajector</span>(sr1, tr1).
<span style="color: #84ffff;">landmark</span>(sr1, lm2).
<span style="color: #84ffff;">spatial_indicator</span>(sr1, s2).
<span style="color: #84ffff;">gtype</span>(sr1, region).
<span style="color: #84ffff;">stype</span>(sr1, rcc8).
<span style="color: #84ffff;">value</span>(sr1, ec).
<span style="color: #84ffff;">frame_of_reference</span>(sr1, intrinsic).

<span style="color: #84ffff;">spatial_relation</span>(sr3).
<span style="color: #84ffff;">trajector</span>(sr3, tr1).
<span style="color: #84ffff;">landmark</span>(sr3, lm3).
<span style="color: #84ffff;">spatial_indicator</span>(sr3, s3).
<span style="color: #84ffff;">gtype</span>(sr1, direction).
<span style="color: #84ffff;">stype</span>(sr1, relative).
<span style="color: #84ffff;">value</span>(sr1, below).
<span style="color: #84ffff;">frame_of_reference</span>(intrinsic).

</pre>
</div>
</div>
</div>


<div id="outline-container-org01ed080" class="outline-4">
<h4 id="org01ed080"><span class="section-number-4">3.2.2</span> Path and route descriptions</h4>
<div class="outline-text-4" id="text-3-2-2">
<p class="verse">
The man came from between the shops, ran along the road and disappeared down the alley by the church.<br />
</p>

<p>
Here the motion indicators are omitted. 
</p>

<div class="org-src-container">
<pre class="src src-prolog">
<span style="color: #84ffff;">trajector</span>(tr1).
<span style="color: #84ffff;">extent</span>(tr1, <span style="color: #9ccc65;">"the man"</span>).

<span style="color: #84ffff;">landmark</span>(lm1).
<span style="color: #84ffff;">extent</span>(lm1, <span style="color: #9ccc65;">"the shops"</span>).
<span style="color: #84ffff;">path</span>(lm1, beginning).

<span style="color: #84ffff;">landmark</span>(lm2).
<span style="color: #84ffff;">extent</span>(lm2, <span style="color: #9ccc65;">"the alley"</span>).
<span style="color: #84ffff;">path</span>(lm2, end).

<span style="color: #84ffff;">trajector</span>(tr2).
<span style="color: #84ffff;">extent</span>(tr2, <span style="color: #9ccc65;">"the alley"</span>).

<span style="color: #84ffff;">landmark</span>(lm3).
<span style="color: #84ffff;">extent</span>(lm3, <span style="color: #9ccc65;">"the church"</span>).

<span style="color: #84ffff;">spatial_indicator</span>(s1).
<span style="color: #84ffff;">extent</span>(s1, <span style="color: #9ccc65;">"between"</span>).

<span style="color: #84ffff;">spatial_indicator</span>(s2).
<span style="color: #84ffff;">extent</span>(s2, <span style="color: #9ccc65;">"along"</span>).

<span style="color: #84ffff;">spatial_indicator</span>(s3).
<span style="color: #84ffff;">extent</span>(s3, <span style="color: #9ccc65;">"down"</span>).

<span style="color: #84ffff;">spatial_indicator</span>(s4).
<span style="color: #84ffff;">extent</span>(s4, <span style="color: #9ccc65;">"by"</span>).

<span style="color: #84ffff;">spatial_relation</span>(sr1).
<span style="color: #84ffff;">trajector</span>(sr1, tr1).
<span style="color: #84ffff;">landmark</span>(sr1, lm1).



</pre>
</div>
</div>
</div>
